module.exports={


    indexTheater:[   {  shop:['环银电影城(世贸广场店)',9.9],
                       adress:'江汉区解放大道686号世贸广场8楼',
                        tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
                        times:'10:25|11:20|12:05'
                              },
    {   shop:['武商摩尔国际电影城(国广店)',9.9],
        adress:'江汉区解放大道690号武汉国际广场C座7楼',
        tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
        times:'10:30|13:45|15:20'

    },
    {  shop:['璇宫国际影城(江汉路店)',9.9],
        adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
        tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
        times:'10:40|11:40|13:00'

    },
    {  shop:['亚瑟影城',9.9],
        adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
        tips:{blue:['座']},
        times:'13:10|13:50|14:20'

    },
    {  shop:['万达国际影城(大智路店)',14.9],
        adress:'江岸区黄兴路长青广场E座4楼(沃尔玛超市)',
        tips:{blue:['座','退'],orang:['小吃']},
        times:'10:25|11:20|12:05'

    },
    {  shop:['环银电影城(世贸广场店)',9.9],
        adress:'江汉区解放大道686号世贸广场8楼',
        tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
        times:'10:30|13:45|15:20'
    },
    {   shop:['武商摩尔国际电影城(国广店)',9.9],
        adress:'江汉区解放大道690号武汉国际广场C座7楼',
        tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
        times:'10:40|11:40|13:00'

    },
    {  shop:['璇宫国际影城(江汉路店)',9.9],
        adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
        tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
        times:'13:10|13:50|14:20'

    },
    {  shop:['亚瑟影城',9.9],
        adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
        tips:{blue:['座']},
        times:'10:25|11:20|12:05'

    },
        {  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:25|11:20|12:05'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            times:'10:30|13:45|15:20'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:40|11:40|13:00'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            times:'13:10|13:50|14:20'

        },
        {  shop:['万达国际影城(大智路店)',14.9],
            adress:'江岸区黄兴路长青广场E座4楼(沃尔玛超市)',
            tips:{blue:['座','退'],orang:['小吃']},
            times:'10:25|11:20|12:05'

        },
        {  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:30|13:45|15:20'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            times:'10:40|11:40|13:00'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'13:10|13:50|14:20'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            times:'10:25|11:20|12:05'

        },{  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:25|11:20|12:05'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            times:'10:30|13:45|15:20'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:40|11:40|13:00'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            times:'13:10|13:50|14:20'

        },
        {  shop:['万达国际影城(大智路店)',14.9],
            adress:'江岸区黄兴路长青广场E座4楼(沃尔玛超市)',
            tips:{blue:['座','退'],orang:['小吃']},
            times:'10:25|11:20|12:05'

        },
        {  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:30|13:45|15:20'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            times:'10:40|11:40|13:00'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'13:10|13:50|14:20'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            times:'10:25|11:20|12:05'

        },{  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:25|11:20|12:05'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            times:'10:30|13:45|15:20'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:40|11:40|13:00'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            times:'13:10|13:50|14:20'

        },
        {  shop:['万达国际影城(大智路店)',14.9],
            adress:'江岸区黄兴路长青广场E座4楼(沃尔玛超市)',
            tips:{blue:['座','退'],orang:['小吃']},
            times:'10:25|11:20|12:05'

        },
        {  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'10:30|13:45|15:20'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            times:'10:40|11:40|13:00'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            times:'13:10|13:50|14:20'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            times:'10:25|11:20|12:05'

        }


],
    cityTheater:[   {  shop:['环银电影城(世贸广场店)',9.9],
        adress:'江汉区解放大道686号世贸广场8楼',
        tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
        hui:'天才捕手等3部影片特惠',
        ka:'开卡购票首单更优惠'
    },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            hui:'最终幻想15:王者之剑等3部影片特惠'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            hui:'天才捕手等3部影片特惠',
            ka:'开卡购票首单更优惠'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            hui:'天才捕手等3部影片特惠'

        },
        {  shop:['万达国际影城(大智路店)',14.9],
            adress:'江岸区黄兴路长青广场E座4楼(沃尔玛超市)',
            tips:{blue:['座','退'],orang:['小吃']},
            hui:'最终幻想15:王者之剑等3部影片特惠'

        },
        {  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            hui:'天才捕手等3部影片特惠',
            ka:'开卡购票首单更优惠'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            hui:'最终幻想15:王者之剑等3部影片特惠'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            hui:'天才捕手等3部影片特惠',
            ka:'开卡购票首单更优惠'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            hui:'天才捕手等3部影片特惠'

        },
        {  shop:['万达国际影城(大智路店)',14.9],
            adress:'江岸区黄兴路长青广场E座4楼(沃尔玛超市)',
            tips:{blue:['座','退'],orang:['小吃']},
            hui:'最终幻想15:王者之剑等3部影片特惠'

        },
        {  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            hui:'天才捕手等3部影片特惠',
            ka:'开卡购票首单更优惠'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            hui:'最终幻想15:王者之剑等3部影片特惠'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            hui:'天才捕手等3部影片特惠',
            ka:'开卡购票首单更优惠'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            hui:'天才捕手等3部影片特惠'

        },
        {  shop:['万达国际影城(大智路店)',14.9],
            adress:'江岸区黄兴路长青广场E座4楼(沃尔玛超市)',
            tips:{blue:['座','退'],orang:['小吃']},
            hui:'最终幻想15:王者之剑等3部影片特惠'

        },
        {  shop:['环银电影城(世贸广场店)',9.9],
            adress:'江汉区解放大道686号世贸广场8楼',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            hui:'天才捕手等3部影片特惠',
            ka:'开卡购票首单更优惠'
        },
        {   shop:['武商摩尔国际电影城(国广店)',9.9],
            adress:'江汉区解放大道690号武汉国际广场C座7楼',
            tips:{blue:['座','巨幕厅','4DX厅','改签'],orang:['小吃']},
            hui:'最终幻想15:王者之剑等3部影片特惠'

        },
        {  shop:['璇宫国际影城(江汉路店)',9.9],
            adress:'江汉区江汉一路45号璇宫饭店5楼(中心百货旁)',
            tips:{blue:['座','退','改签'],orang:['小吃','折扣卡']},
            hui:'天才捕手等3部影片特惠',
            ka:'开卡购票首单更优惠'

        },
        {  shop:['亚瑟影城',9.9],
            adress:'江汉区江汉一路欧利新天地三楼(建设银行楼上)',
            tips:{blue:['座']},
            hui:'天才捕手等3部影片特惠'

        },
        {  shop:['万达国际影城(大智路店)',14.9],
            adress:'江岸区黄兴路长青广场E座4楼(沃尔玛超市)',
            tips:{blue:['座','退'],orang:['小吃']},
            hui:'最终幻想15:王者之剑等3部影片特惠'

        }


    ],
    wanda:[
        {   shop:['万达国际影城(中心广场店)',21.9],
            adress:'东西湖区吴家山街中心广场四层',
            tips:{blue:['座','退']}
        },
        {   shop:['万达国际电影城(沌口经开店)',25.9],
            adress:'蔡甸区东风大道111号经开万达广场3楼',
            tips:{blue:['座','退']}
        },
        {   shop:['万达国际电影城(菱角湖店)',15.9],
            adress:'江汉区唐家墩路5号菱角湖万达广场4楼（新华西路口）',
            tips:{blue:['座','退']}
        },
        {   shop:['万达国际电影城(钟家村汉商店)',15.9],
            adress:'汉阳区汉阳大道128号汉商银座购物中心F栋5楼（近汉阳商场）',
            tips:{blue:['座','退']}
        },
        {   shop:['万达国际电影城(江汉路店)',24.9],
            adress:'江汉区江汉路交通路1号万达广场C座2层（悦荟广场）',
            tips:{blue:['座','退']}
        }




    ],
    seatdata:{
        title:'金刚:骷髅岛',
        shop:'武商摩尔国际电影城(国广店)',
        time:'今天16:25',
        effects:'国语3D',
        room:'5号厅',
        center:9,
        price:28,
        seat:[[0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,0],
            [0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,0],
            [0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1],
            [0,0,0,0,1,1,3,3,3,1,1,1,1,1,1,1],
            [0,0,0,0,1,1,1,1,3,3,1,1,1,1,1,1],
            [0,0,0,0,1,1,1,3,3,3,3,3,1,1,1,1],
            [0,0,0,0,1,1,1,3,3,3,3,3,3,1,1,1],
            [0,0,0,0,1,1,1,1,3,3,3,3,1,1,1,1],
            [0,0,0,0,1,1,1,1,3,3,1,1,1,1,1,1],
            [1,1,1,0,1,1,1,1,1,1,3,3,1,1,1,1],
            [1,1,1,1,1,1,1,1,3,1,1,1,3,1,1,1]


        ]

    }

}