Page({
  data: {
    list: [{
      description: '判断伤者有无呼吸,(1)先压额抬下巴、 把脸凑近伤者鼻子上方,感受有无无呼出的气息。',
      src: '../../assets/images/panduan.gif',
    }, {
      description: '目光顺着方向观看伤者腹部有无 呼吸的起伏动作。',
      src: '../../assets/images/huxi.gif',
    }, {
      description: '确认伤者无意识无呼吸,开始对其进行 急救,并大声呼喊周围的人帮忙施救和 拨打 120,施救前确保自己、患者和旁 人的安全,如有必要,先把患者转移到安全地带,再在进行施救。',
      src: '../../assets/images/hujiu.gif',
    }, {
      description: '定位:两只手指指向胸肋最下方,手掌 贴近手指完成心脏定位,手掌底部作为 接触点定位心脏的手掌不动,另外一只 手从定位好的手背处进行交叉相握双手 握好,准备进行按压,按压时要只用手 掌底部发力,以免造成受力不均压伤肋骨。',
      src: '../../assets/images/dingwei.gif',
    }, {
      description: '以每分钟 100-120 下的频率进行按压, 按压时候可参考箭头的运动频率。深度 为 5~6cm,按压 30 次停止按压,进行下一步人工呼吸。',
      src: '../../assets/images/anya.gif',
    }, {
      description: '对其进行人工呼吸,一只手捏住伤者鼻 子,另一只手把病者嘴张开对其进行人 工呼吸;用嘴完全地包住病员的嘴巴, 将气体吹入病员的体内,吹气两下完成人工呼吸。',
      src: '../../assets/images/rghx.gif',
    }, {
      description: '按压 30 次,吹气 2 次为一个循环,五 个循环后重新判断有无呼吸,如果仍无 恢复意识,则继续进行五个循环,等待 救护人员到来。',
    }, {
      description: '如果伤者恢复了呼吸但依然没意识,让 病人侧卧,头部后仰,可以跟他说话,安抚他,即使没意识也可以听见。',
      src: '../../assets/images/cewo.gif',
    }],
  }
});
